class YaScooterHomePageFAQ:
    answer1 = "Сутки — 400 рублей. Оплата курьеру — наличными или картой."
    answer2 = "Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим."
    answer3 = "Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30."
    answer4 = "Только начиная с завтрашнего дня. Но скоро станем расторопнее."
    answer5 = "Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010."
    answer6 = "Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится."
    answer7 = "Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои."
    answer8 = "Да, обязательно. Всем самокатов! И Москве, и Московской области."

class YaScooterOrderPageData:
    data_sets = {
        'data_set1': {
            'first_name': 'ПервоеИмя',
            'last_name': 'ПерваяФамилия',
            'address': 'Березовая аллея 17к1',
            'subway_name': 'Отрадное',
            'phone_number': '+79690000000',
            'date': '19.04.2025',
            'rental_period': 1,
            'color': [0],
            'comment_for_courier': 'Комментарий',
            'description': 'Валидные данные'
        },
        'data_set2':
            {'first_name': 'ВтороеИмя',
             'last_name': 'ВтораяФамилия',
             'address': 'Олонецкая 4',
             'subway_name': 'Отрадное',
             'phone_number': '+79691111111',
             'date': '20.04.2025',
             'rental_period': 2,
             'color': [0, 1],
             'comment_for_courier': 'Желательно черный',
             'description': 'Валидные данные'
             },
    }